app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" LIMIT ?  [["LIMIT", 3]]
---
    def html
        @songs = Songs.all.limit(3)

SELECT  "songs".* FROM "songs" LIMIT ?  [["LIMIT", 3]]
---
    def json
        songs = Songs.all.limit(3)